In [2]:
## Lets check which version of python we are using
!python --version

Python 3.8.8

In [3]:
# Now lets begin with new codes and import Pandas

import pandas as pd
import numpy as np

In [4]:
## Lets create a mock Dataframe
## DataFrame takes data as the first parameter. Second one is the index or row, Third is column and then data type.
## np.arange give 0 to 19 and using reshape, we form it as a row-column matrix

df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=["Column1","Column2","Column3","Column4"])

In [5]:
## Now lets print the df
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [6]:
## We can save the df in a csv
df.to_csv('test.csv')

In [24]:
## We will investigate the way to access the elements: .loc and .iloc - index loc


print(df.loc['Row1'])
print(type(df.loc['Row1']))

## Note: Series can be just one row or one column while DataFrame will have more than one column and row

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int64
<class 'pandas.core.series.Series'>

In [22]:
df.iloc[:,:]

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [23]:
## Take the elements from the Column2
df.iloc[:,1:]

      Column2  Column3  Column4
Row1        1        2        3
Row2        5        6        7
Row3        9       10       11
Row4       13       14       15
Row5       17       18       19

In [25]:
#convert Dataframes into array
df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [27]:
df.isna().sum()

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [28]:
df['Column1'].value_countscounts()

0     1
8     1
4     1
16    1
12    1
Name: Column1, dtype: int64

In [29]:
df['Column1'].unique()

array([ 0,  4,  8, 12, 16])

In [32]:
df[['Column1', 'Column2']]

      Column1  Column2
Row1        0        1
Row2        4        5
Row3        8        9
Row4       12       13
Row5       16       17

In [36]:
df[['Column1', 'Column2']].notna().sum()

Column1    5
Column2    5
dtype: int64